//20191127 project1 - 실적 보고서 생성 프로그램
#include<iostream>
#include <windows.h> //입력 실수 딜레이
using namespace std;

int main() {
	cout << "실적 보고서 생성 프로그램 입니다.\n";
	int arr[6][6] = {
					{1, 34000, 56000, 23000, 78000, 0},
					{2, 23000, 65000, 18000, 94000, 0},
					{3, 25000, 34000, 19000, 68000, 0},
					{4, 18000, 52000, 23500, 73950, 0},
					{5, 25000, 38000, 26000, 64000, 0},
					{888, 0, 0, 0, 0, 0} };

	cout << "직접 입력하시려면 0번을 눌러 주세요 >> ";
	int select; cin >> select;
	if (select == 0) { 
		for (int i = 0; i < 5; i++) {
			for (int j = 1; j < 5; j++) {
				cout << "판매자 " << i + 1 << "의 " << j << "분기 실적을 입력하세요 >";
				cin >> arr[i][j];
			}
			arr[i][0] = i + 1; //판매자 넘버
			puts("");
		}
	}
	cout << "잠시만 기다려 주십시오...\n";
	Sleep(2000);	//입력 실수 딜레이

	//평균과 총합 계산
	for (int i = 0; i < 5; i++) {	
		for (int j = 1; j < 5; j++) {
			arr[i][5] += arr[i][j];
			arr[5][j] += arr[i][j];
			arr[5][5] += arr[i][j];
		}
	}
	
	//배열 출력
	cout << "$:아래의 화면이 어긋날 경우 CMD설정에서 글자 크기를 줄이십시오\n";	
	cout << "=================================================================================\n";
	cout << "판매자		1/4분기		2/4분기		3/4분기		4/4분기		합산\n";
	cout << "=================================================================================\n";
	for (int i = 0; i < 6; i++) {
		for (int j = 0; j < 6; j++) {
			if (arr[i][j] == 888)
				cout << "판매총합" << "	";
			else
				cout << arr[i][j] << "		";
		}
		puts("");
	}

	//분기별 평균과 비율 출력
	cout << "=================================================================================\n";
	cout << "분기평균" << "	";	
	cout.precision(2);
	for (int j = 1; j < 6; j++) {
		printf("%.2f	", arr[5][j]/5.0);
	}
	puts("");

	float quartmp[6] = { 0 };
	cout << "비율" << "		";
	for (int j = 1; j < 6; j++) {
		quartmp[j] = (arr[5][j] / 5.0) / (arr[5][5] / 5.0) * 100;
		printf("%.2f		", quartmp[j]);
	}

	//사원별 평균과 비율 계산
	cout << "=================================================================================\n";
	cout << "사원별 평균값" << endl;
	float persontmp[5];
	for (int i = 0; i < 5; i++) {
			cout << "사원 " << i + 1 << "의 평균 : " << arr[i][5] / 4 << "	, ";
			cout << "사원 " << i + 1 << "의 지분값 : " << float(arr[i][5]) / arr[5][5] * 100 << endl;
			persontmp[i] = float(arr[i][5]) / arr[5][5] * 100;
	}

	//그래프 1 : 분기별 비교 그래프
	cout << "=================================================================================\n";
	cout << "그래프 : 실적 비교☞";
	cout << "\n\n1/4분기	┃";
	for (int i = 0; i < quartmp[1]/2; i++)
		cout << "▤";
	cout << "\n	┃\n2/4분기	┃";
	for (int i = 0; i < quartmp[2]/2; i++)
		cout << "▤";
	cout << "\n	┃\n3/4분기	┃";
	for (int i = 0; i < quartmp[3] / 2; i++)
		cout << "▤";
	cout << "\n	┃\n4/4분기	┃";
	for (int i = 0; i < quartmp[4] / 2; i++)
		cout << "▤";
	cout << "\n	┗━━━━━━━━━━━━━━━━━━━━━━━";
	cout << "\n실적%	 낮은실적				높은실적\n";

	//그래프 2 : 분기별 비율 그래프
	cout << "=================================================================================\n";
	cout << "그래프 : 지분 조정☞";
	cout << "\n\n1/4분기	┃";
	for (int i = 0; i < round(round(quartmp[1]) / 10.0); i++) //소수점 반올림 후 십의 자리까지 반올림
		cout << " ▤ ";
	cout << "\n	┃\n2/4분기	┃";
	for (int i = 0; i < round(round(quartmp[2]) / 10.0); i++)
		cout << " ▤ ";
	cout << "\n	┃\n3/4분기	┃";
	for (int i = 0; i < round(round(quartmp[3]) / 10.0); i++)
		cout << " ▤ ";
	cout << "\n	┃\n4/4분기	┃";
	for (int i = 0; i < round(round(quartmp[4]) / 10.0); i++)
		cout << " ▤ ";
	cout << "\n	┗━━━━━━━━━━━━━━━━━━━━";
	cout << "\n실적%	 0	20	40	60	80	100\n";

	//그래프 3 : 사원별 비율 그래프
	cout << "=================================================================================\n";
	cout << "그래프 : 사원별 영업 실적☞";
	cout << "\n\n사원 1	┃";
	for (int i = 0; i < round(round(persontmp[0]) / 10.0); i++) //반올림 후 십의 자리까지 반올림
		cout << " ▤ ";
	cout << "\n	┃\n사원 2	┃";
	for (int i = 0; i < round(round(persontmp[1]) / 10.0); i++)
		cout << " ▤ ";
	cout << "\n	┃\n사원 3	┃";
	for (int i = 0; i < round(round(persontmp[2]) / 10.0); i++)
		cout << " ▤ ";
	cout << "\n	┃\n사원 4	┃";
	for (int i = 0; i < round(round(persontmp[3]) / 10.0); i++)
		cout << " ▤ ";
	cout << "\n	┃\n사원 5	┃";
	for (int i = 0; i < round(round(persontmp[4]) / 10.0); i++)
		cout << " ▤ ";
	cout << "\n	┗━━━━━━━━━━━━━━━━━━━━";
	cout << "\n실적%	 0	20	40	60	80	100\n";
}